/*
 * Сделано в SharpDevelop.
 * Пользователь: Catfish
 * Дата: 21.03.2015
 * Время: 15:29
 * 
 * Для изменения этого шаблона используйте Сервис | Настройка | Кодирование | Правка стандартных заголовков.
 */
using System;
using System.IO;
using System.ComponentModel;
using System.Drawing;
using System.Windows.Forms;
using AdminQA.Service;
using MySql.Data.MySqlClient;

namespace AdminQA.Forms
{
	/// <summary>
	/// Description of Administrator.
	/// </summary>
	public partial class Administrator : Form
	{
		public Administrator()
		{
			//
			// The InitializeComponent() call is required for Windows Forms designer support.
			//
			InitializeComponent();
			
			//
			// TODO: Add constructor code after the InitializeComponent() call.
			//
		}
		
		private String[,] table_DecHex = {{"32","20"},{"33","21"},{"34","22"},{"35","23"},{"36","24"},{"37","25"},{"38","26"},{"39","27"},
			{"40","28"},{"41","29"},{"42","2A"},{"43","2B"},{"44","2C"},{"45","2D"},{"46","2E"},{"47","2F"},{"48","30"},{"49","31"},
			{"50","32"},{"51","33"},{"52","34"},{"53","35"},{"54","36"},{"55","37"},{"56","38"},{"57","39"},{"58","3A"},{"59","3B"},
			{"60","3C"},{"61","3D"},{"62","3E"},{"63","3F"},{"64","40"},{"65","41"},{"66","42"},{"67","43"},{"68","44"},{"69","45"},
			{"70","46"},{"71","47"},{"72","48"},{"73","49"},{"74","4A"},{"75","4B"},{"76","4C"},{"77","4D"},{"78","4E"},{"79","4F"},
			{"80","50"},{"81","51"},{"82","52"},{"83","53"},{"84","54"},{"85","55"},{"86","56"},{"87","57"},{"88","58"},{"89","59"},
			{"90","5A"},{"91","5B"},{"92","5C"},{"93","5D"},{"94","5E"},{"95","5F"},{"96","60"},{"97","61"},{"98","62"},{"99","63"},
			{"100","64"},{"101","65"},{"102","66"},{"103","67"},{"104","68"},{"105","69"},{"106","6A"},{"107","6B"},{"108","6C"},{"109","6D"},
			{"110","6E"},{"111","6F"},{"112","70"},{"113","71"},{"114","72"},{"115","73"},{"116","74"},{"117","75"},{"118","76"},{"119","77"},
			{"120","78"},{"121","79"},{"122","7A"},{"123","7B"},{"124","7C"},{"125","7D"},{"126","7E"},{"127","7F"},{"128","80"},{"129","81"},
			{"130","82"},{"131","83"},{"132","84"},{"133","85"},{"134","86"},{"135","87"},{"136","88"},{"137","89"},{"138","8A"},{"139","8B"},
			{"140","8C"},{"141","8D"},{"142","8E"},{"143","8F"},{"144","90"},{"145","91"},{"146","92"},{"147","93"},{"148","94"},{"149","95"},
			{"150","96"},{"151","97"},{"152","98"},{"153","99"},{"154","9A"},{"155","9B"},{"156","9C"},{"157","9D"},{"158","9E"},{"159","9F"},
			{"160","A0"},{"161","A1"},{"162","A2"},{"163","A3"},{"164","A4"},{"165","A5"},{"166","A6"},{"167","A7"},{"168","A8"},{"169","A9"},
			{"170","AA"},{"171","AB"},{"172","AC"},{"173","AD"},{"174","AE"},{"175","AF"},{"176","B0"},{"177","B1"},{"178","B2"},{"179","B3"},
			{"180","B4"},{"181","B5"},{"182","B6"},{"183","B7"},{"184","B8"},{"185","B9"},{"186","BA"},{"187","BB"},{"188","BC"},{"189","BD"},
			{"190","BE"},{"191","BF"},{"192","C0"},{"193","C1"},{"194","C2"},{"195","C3"},{"196","C4"},{"197","C5"},{"198","C6"},{"199","C7"},
			{"200","C8"},{"201","C9"},{"202","CA"},{"203","CB"},{"204","CC"},{"205","CD"},{"206","CE"},{"207","CF"},{"208","D0"},{"209","D1"},
			{"210","D2"},{"211","D3"},{"212","D4"},{"213","D5"},{"214","D6"},{"215","D7"},{"216","D8"},{"217","D9"},{"218","DA"},{"219","DB"},
			{"220","DC"},{"221","DD"},{"222","DE"},{"223","DF"},{"224","E0"},{"225","E1"},{"226","E2"},{"227","E3"},{"228","E4"},{"229","E5"},
			{"230","E6"},{"231","E7"},{"232","E8"},{"233","E9"},{"234","EA"},{"235","EB"},{"236","EC"},{"237","ED"},{"238","EE"},{"239","EF"},
			{"240","F0"},{"241","F1"},{"242","F2"},{"243","F3"},{"244","F4"},{"245","F5"},{"246","F6"},{"247","F7"},{"248","F8"},{"249","F9"},
			{"250","FA"},{"251","FB"},{"252","FC"},{"253","FD"},{"254","FE"},{"255","FF"}
		};
		
		private String[,] table_ASCII = {{" ","32","20"},{"!","33","21"},{"\"","34","22"},
			{"#","35","23"},{"$","36","24"},{"%","37","25"},{"&","38","26"},{"'","39","27"},
			{"(","40","28"},{")","41","29"},{"*","42","2A"},{"+","43","2B"},{",","44","2C"},
			{"-","45","2D"},{".","46","2E"},{"/","47","2F"},{"0","48","30"},{"1","49","31"},
			{"2","50","32"},{"3","51","33"},{"4","52","34"},{"5","53","35"},{"6","54","36"},
			{"7","55","37"},{"8","56","38"},{"9","57","39"},{":","58","3A"},{";","59","3B"},
			{"<","60","3C"},{"=","61","3D"},{">","62","3E"},{"?","63","3F"},{"@","64","40"},
			{"A","65","41"},{"B","66","42"},{"C","67","43"},{"D","68","44"},{"E","69","45"},
			{"F","70","46"},{"G","71","47"},{"H","72","48"},{"I","73","49"},{"J","74","4A"},
			{"K","75","4B"},{"L","76","4C"},{"M","77","4D"},{"N","78","4E"},{"O","79","4F"},
			{"P","80","50"},{"Q","81","51"},{"R","82","52"},{"S","83","53"},{"T","84","54"},
			{"U","85","55"},{"V","86","56"},{"W","87","57"},{"X","88","58"},{"Y","89","59"},
			{"Z","90","5A"},{"[","91","5B"},{"\\","92","5C"},{"]","93","5D"},{"^","94","5E"},
			{"_","95","5F"},{"`","96","60"},{"a","97","61"},{"b","98","62"},{"c","99","63"},
			{"d","100","64"},{"e","101","65"},{"f","102","66"},{"g","103","67"},{"h","104","68"},
			{"i","105","69"},{"j","106","6A"},{"k","107","6B"},{"l","108","6C"},{"m","109","6D"},
			{"n","110","6E"},{"o","111","6F"},{"p","112","70"},{"q","113","71"},{"r","114","72"},
			{"s","115","73"},{"t","116","74"},{"u","117","75"},{"v","118","76"},{"w","119","77"},
			{"x","120","78"},{"y","121","79"},{"z","122","7A"},{"{","123","7B"},{"|","124","7C"},
			{"}","125","7D"},{"~","126","7E"},{"■","127","7F"},
			{"Ç","128","80"},{"ü","129","81"},{"é","130","82"},{"â","131","83"},{"ä","132","84"},
			{"à","133","85"},{"å","134","86"},{"ç","135","87"},{"ê","136","88"},{"ë","137","89"},
			{"è","138","8A"},{"ï","139","8B"},{"î","140","8C"},{"ì","141","8D"},{"Ä","142","8E"},
			{"Å","143","8F"},{"É","144","90"},{"æ","145","91"},{"Æ","146","92"},{"ô","147","93"},
			{"ö","148","94"},{"ò","149","95"},{"û","150","96"},{"ù","151","97"},{"ÿ","152","98"},
			{"Ö","153","99"},{"Ü","154","9A"},{"ø","155","9B"},{"£","156","9C"},{"Ø","157","9D"},
			{"×","158","9E"},{"ƒ","159","9F"},{"á","160","A0"},{"í","161","A1"},{"ó","162","A2"},
			{"ú","163","A3"},{"ñ","164","A4"},{"Ñ","165","A5"},{"ª","166","A6"},{"º","167","A7"},
			{"¿","168","A8"},{"®","169","A9"},{"¬","170","AA"},{"½","171","AB"},{"¼","172","AC"},
			{"¡","173","AD"},{"«","174","AE"},{"»","175","AF"},{"░","176","B0"},{"▒","177","B1"},
			{"▓","178","B2"},{"│","179","B3"},{"┤","180","B4"},{"Á","181","B5"},{"Â","182","B6"},
			{"À","183","B7"},{"©","184","B8"},{"╣","185","B9"},{"║","186","BA"},{"╗","187","BB"},
			{"╝","188","BC"},{"¢","189","BD"},{"¥","190","BE"},{"┐","191","BF"},{"└","192","C0"},
			{"┴","193","C1"},{"┬","194","C2"},{"├","195","C3"},{"─","196","C4"},{"┼","197","C5"},
			{"ã","198","C6"},{"Ã","199","C7"},{"╚","200","C8"},{"╔","201","C9"},{"╩","202","CA"},
			{"╦","203","CB"},{"╠","204","CC"},{"═","205","CD"},{"╬","206","CE"},{"¤","207","CF"},
			{"ð","208","D0"},{"Ð","209","D1"},{"Ê","210","D2"},{"Ë","211","D3"},{"È","212","D4"},
			{"ı","213","D5"},{"Í","214","D6"},{"Î","215","D7"},{"Ï","216","D8"},{"┘","217","D9"},
			{"┌","218","DA"},{"█","219","DB"},{"▄","220","DC"},{"¦","221","DD"},{"Ì","222","DE"},
			{"▀","223","DF"},{"Ó","224","E0"},{"ß","225","E1"},{"Ô","226","E2"},{"Ò","227","E3"},
			{"õ","228","E4"},{"Õ","229","E5"},{"µ","230","E6"},{"þ","231","E7"},{"Þ","232","E8"},
			{"Ú","233","E9"},{"Û","234","EA"},{"Ù","235","EB"},{"ý","236","EC"},{"Ý","237","ED"},
			{"¯","238","EE"},{"´","239","EF"},{"≡","240","F0"},{"±","241","F1"},{"‗","242","F2"},
			{"¾","243","F3"},{"¶","244","F4"},{"§","245","F5"},{"÷","246","F6"},{"¸","247","F7"},
			{"°","248","F8"},{"¨","249","F9"},{"·","250","FA"},{"¹","251","FB"},{"³","252","FC"},
			{"²","253","FD"},{"■","254","FE"},{"","255","FF"}
		};
		
		
		bool DecodeFileConfig()
		{
				RichTextBox rtb = new RichTextBox();
				rtb.LoadFile(Config.fileConfig, RichTextBoxStreamType.PlainText);
				
				String code = "";
				String dec = "";
				for(int i = 0; i < rtb.Text.Length; i++)
				{
					if(rtb.Text[i].ToString() == " ")
					{
						for(int idec = 0; idec < (table_DecHex.Length / 2); idec++)
						{
							if(code == table_DecHex[idec,1])
							{
								int numDec = Convert.ToInt32(table_DecHex[idec,0]) - 1;
								dec += numDec.ToString() + " ";
								break;
							}
						}
						code = "";
					}else{
						code += rtb.Text[i].ToString();
					}
				}
				
				rtb.Clear();
				for(int j = 0; j < dec.Length; j++)
				{
					if(dec[j].ToString() == " ")
					{
						for(int iascii = 0; iascii < (table_ASCII.Length / 3); iascii++)
						{
							if(code == table_ASCII[iascii,1])
							{
								rtb.Text += table_ASCII[iascii,0];
								break;
							}
						}
						code = "";
					}else{
						code += dec[j].ToString();
					}
				}
				
				//MessageBox.Show(rtb.Text);
				
				Config.Server = "";
				Config.DataBase = "";
				Config.Uid = "";
				Config.Pwd = "";
				int index = 0;
				for(int k = 0; k < rtb.Text.Length; k++)
				{
					if(rtb.Text[k].ToString() == "|")
					{
						index++;
					}else{
						if(index == 0)	Config.Server += rtb.Text[k];
						if(index == 1)	Config.DataBase += rtb.Text[k];
						if(index == 2)	Config.Uid += rtb.Text[k];
						if(index == 3)	Config.Pwd += rtb.Text[k];
					}
				}
				//MessageBox.Show("Server[" + Config.Server + "]  DataBase[" + Config.DataBase + "]  Uid[" + Config.Uid + "]  Pwd["+ Config.Pwd +"]");
				return true;
		}
		
		
		/* Проверка соединения */
		bool CheckConnect()
		{
			MySqlConnection MySql_Connection = new MySqlConnection();
			//проверка подключения к базе данных
			try{
				MySql_Connection.ConnectionString = "server=" + Config.Server + ";database=" + Config.DataBase + ";uid=" + Config.Uid + ";pwd=" + Config.Pwd + ";";
				MySql_Connection.Open();
				MySql_Connection.Close();
			}catch(Exception ex){
				MySql_Connection.Close();
				MessageBox.Show("Нет соединения с базой данных "  + Config.DataBase +  " программа будет закрыта.\nУбедитесь что сервер отвечает и у вас есть интернет.\nПроверьте наличие данной базы данных на сервере.", "Сообщение", MessageBoxButtons.OK);
				Application.Exit();
			}
			return true;
		}
		
		
		void AdministratorLoad(object sender, EventArgs e)
		{
			/* Файл конфигурации */
			if(!File.Exists(Config.fileConfig)) //файл не найден
			{
				MessageBox.Show("Фыйл конфигурации не найден, перезапустите администратор!", "Сообщение");
			}else{
				if(DecodeFileConfig())
				{
					// показываем окно авторизации если база данных существует
					if(CheckConnect())
					{
						Authorization authorization = new Authorization();
						authorization.ShowDialog();
					}
				}
			}
		}
		
		void AdministratorClosing(Object sender, CancelEventArgs e) 
		{
			if (MessageBox.Show("Выйти из администратора?", "Вопрос", MessageBoxButtons.YesNo) == DialogResult.Yes) {
          		e.Cancel = false;
          		Application.Exit();
          	}
       		else {
          		e.Cancel = true;
          	}
    	}
		
		/* калькулятор --------------------------------------------------*/
		void ShowCalc()
		{
			FormServiceCalculator Calc = new FormServiceCalculator(true);
			Calc.valuePaste = false;
			Calc.MdiParent = this;
			Calc.Show();
		}
		
		
		void КалькуляторToolStripMenuItemClick(object sender, EventArgs e)
		{
			ShowCalc();
		}
		
		void ВыходToolStripMenuItemClick(object sender, EventArgs e)
		{
			Close();
		}
		
		/* Пользователи */
		void ПользователиToolStripMenuItemClick(object sender, EventArgs e)
		{
			
		}
		
		void ToolStripButton1Click(object sender, EventArgs e)
		{
			
		}
		
		
		/* О программе*/
		void ShowAbout()
		{
			if(Classes.ClassForms.formAbout == false)
			{
				About about = new About();
				about.MdiParent = this;
				about.Show();
			}
		}
		
		void ОПрограммеToolStripMenuItemClick(object sender, EventArgs e)
		{
			ShowAbout();
		}
		
		void ToolStripButton5Click(object sender, EventArgs e)
		{
			ShowAbout();
		}
	}
}
